{"resume":"\nJORDAN MARAGLIANO\n\n     (778) 788-1903 ♦ jordan.maragliano@gmail.com\n\n                184 Kinsey Drive ♦ Anmore, BC, Canada\n\nSummary\t\n\nMotivated and adaptable business student with strong problem-solving skills, demonstrated through participation in case competitions and project proposals at SFU.\n\nStrong teamwork skills, proven through working successfully with others in a high-pressure restaurant to provide exceptional customer service and as a basketball team point guard.\n\nInnovative thinking skills, highlighted by solving real-world accounting and business problems during the Accounting Student Association (ASA) Achieve Case Competition.\n\nEducation\t\n\nBeedie School of Business, Simon Fraser University, Burnaby \t\t          Expected Graduation: 2028\n\nBachelor of Business Administration (Completed 1st Year). Pursuing accounting and finance concentrations. \n\nCurrently 3.85 GPA, Aspiring CPA, CFA \n\nHighlights: Financial Accounting (A+), Math (A+), Microeconomics (A+), Macroeconomics (A+)\n\nHeritage Woods Secondary\t\t\t\t\t\t                \t              Completed: 2024\n\nDogwood Diploma, Port Moody, British Columbia\n\n4.0 GPA (Grades 11 & 12)\n\nRelevant Course Work\t\n\nFinancial Accounting (Bus 251) - Simon Fraser University\n\nFocused on applying fundamental accounting principles and analytical skills to interpret financial data and produce financial reports.\n\nBeginner to Pro in Excel: Financial Modeling and Valuation (currently in progress) - Udemy course\n\nActively enhancing skills in Excel functions and tools, such as index match, sumifs, and pivot tables. \n\nFinancial modeling: Acquiring skills to create sophisticated valuation models, including discounted cash flow models, and to prepare financial reports such as profit and loss statements.\n\nEmployment History\t\n\nMangia E Scappa, Fort Langley, BC\t \t\t\t\t                  Nov 2023 – April 2024 \n\nPizza Chef \n\nEnhanced time-management and multitasking abilities by preparing and cooking pizzas quickly while maintaining high food quality standards.\n\nCollaborated with kitchen staff to streamline order preparation, contributing to a smooth and fast-paced service environment.\n\nDemonstrated the ability to work in a high-pressure environment by managing up to 8 pizza orders simultaneously, multiple times during 2-hour peak periods.\n\nVolunteer\t\n\nMath Tutor | Heritage Woods Secondary                                                                                 Sep 2024 – Dec 2024 \n\nProvided one-on-one tutoring sessions to 3 students to meet their personal math goals and enhance their mathematical skills and understanding.\n\nExplained concepts in an understandable manner.\n\nInterests\t\n\nPassionate about developing technology skills:\n\nHardware: Assembled 2 high-performance desktop computers\n\nSoftware: Completed Python programming class\n\nInterested in skiing, dirt biking, basketball, chess, and weightlifting \n\n","updatedAt":"2026-02-24T09:40:20.252Z"}